UKS/src/Documents/ПриказКомандировки/ПриказКомандировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказКомандировки</name>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписываетПриказ</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриказСПродлением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуточнаяНормаВыплатВодителю</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыбранныеПриказы</name>
    <attributes>
      <name>НазваниеКомандировки</name>
      <type>
        <types>DocumentRef.КомандировочноеУдостоверение</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыплатаВодителю</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СВозвращением</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СчитатьРабочимиДнями</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыходныеНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочиеНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыходныеОкончание</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочиеОкончание</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВОднодневнуюКомандировку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродлениеПоДату</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UKS/src/Documents/ПриказКомандировки/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроведениеКомандировоных();
		
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ОтменаПроведенияКомандировоных();
	КонецЕсли;
КонецПроцедуры

Процедура ПроведениеКомандировоных()
	
	ТаблицаКоманд = ЭтотОбъект.ВыбранныеПриказы.Выгрузить();
	
	Для Каждого Стр Из ТаблицаКоманд Цикл
		СсылкаНаКоманд = Стр.НазваниеКомандировки.Ссылка;
		ПолученныйКом = СсылкаНаКоманд.ПолучитьОбъект();
		ПолученныйКом.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;

	
КонецПроцедуры

Процедура ОтменаПроведенияКомандировоных() 
	
	ТаблицаКоманд = ЭтотОбъект.ВыбранныеПриказы.Выгрузить();
	
	Для Каждого Стр Из ТаблицаКоманд Цикл
		СсылкаНаКоманд = Стр.НазваниеКомандировки.Ссылка;
		ПолученныйКом = СсылкаНаКоманд.ПолучитьОбъект();
		ПолученныйКом.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;

	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ВыбранныеПриказы.Очистить();
	НомерПриказа = "";
	ДатаПриказа = Дата(1,1,1);
	ПриказСПродлением = Ложь;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Для Каждого Стр из ВыбранныеПриказы Цикл
		ДокСсылка = Стр.НазваниеКомандировки;
		ДокОбъект = ДокСсылка.ПолучитьОбъект();
		ДокОбъект.НомерПриказа = "";
		ДокОбъект.ДатаПриказа = Дата(1,1,1,0,0,0);
		ДокОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
